negotiate-equipment-app/app/models/user.rb

    def insert_products
        products = [
            { name: "Desktop Gamer", price: 252.0 },
            { name: "Notebook",      price: 202.0 },
            { name: "Laser Printer", price: 126.0 },
            { name: "Smartphone",    price: 50.0  },
            { name: "Mouse",         price: 20.0  }
        ]

        products.each do |product|
            self.products.create(name: product[:name], price: product[:price])
---
INSERT INTO "products" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Desktop Gamer"], ["description", nil], ["price", 252.0], ["user_id", 8], ["created_at", "2022-08-07 14:50:11.625101"], ["updated_at", "2022-08-07 14:50:11.625101"]]