negotiate-equipment-app/app/views/users/show.html.erb

      <tbody data-target="infinite-page.container">
        <% @user.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1  [["user_id", 3]]