negotiate-equipment-app/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Machado"], ["description", "Ferramenta de corte"], ["price", 100.0], ["user_id", 1], ["created_at", "2022-08-05 22:42:54.126833"], ["updated_at", "2022-08-05 22:42:54.126833"]]
---
  def create
    @product = Product.new(product_params)
    @product.save!