negotiate-equipment-app/app/controllers/users_controller.rb

  def show
    @users = User.where.not(id: @user.id)
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    @user.save!
---
INSERT INTO "users" ("name", "nickname", "email", "birthdate", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_user_and_chosen_user
      @user = User.find(params[:user_id])
      @chosen_user = User.find(params[:chosen_user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def set_users_products
      @user_equipment = Product.where(id: params[:user_equipment].keys) if params[:user_equipment].present?
---
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 15], ["id", 17]]