negotiate-equipment-app/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "nickname", "email", "birthdate", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save