negotiate-equipment-app/app/controllers/vacations_controller.rb

INSERT INTO "vacations" ("start_date", "end_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["start_date", "2022-10-01"], ["end_date", "2022-10-05"], ["user_id", 1], ["created_at", "2022-08-05 22:47:07.377049"], ["updated_at", "2022-08-05 22:47:07.377049"]]
---
  def create
    @vacation = Vacation.new(vacation_params)
    @vacation.save!

UPDATE "vacations" SET "end_date" = $1, "updated_at" = $2 WHERE "vacations"."id" = $3  [["end_date", "2022-10-10"], ["updated_at", "2022-08-05 22:49:09.096505"], ["id", 1]]
---
  def update
    @vacation.update!(vacation_params)

SELECT "vacations".* FROM "vacations" WHERE "vacations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_vacation
      @vacation = Vacation.find(params[:id])