negotiate-equipment-app/app/views/products/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id %>
    <%= form.collection_select(:user_id, User.all, :id, :to_s, {}, { class: 'form-control', data: { controller: 'select' } }) %>