negotiate-equipment-app/app/controllers/api/v1/reports_controller.rb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "users" INNER JOIN "vacations" ON "vacations"."user_id" = "users"."id" WHERE (vacations.start_date <= '2022-08-07' AND vacations.end_date >= '2022-08-07')
---
            def users_on_vacation
                total_users = User.count.to_f
                amount_in_vacation = User.joins(:vacation)
                                         .where("vacations.start_date <= ? AND vacations.end_date >= ?", @current_date, @current_date)
                                         .count
                                         .to_f

SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "users"
---
            def average_equipment_per_user
                Product.count / User.count

SELECT SUM(price) FROM "users" INNER JOIN "vacations" ON "vacations"."user_id" = "users"."id" INNER JOIN "products" ON "products"."user_id" = "users"."id" WHERE (start_date <= '2022-08-07' AND end_date >= '2022-08-07')
---
            def total_equipment_blocked_price
                User.joins(:vacation, :products).where("start_date <= ? AND end_date >= ?", @current_date, @current_date).sum(:price)